Repository: Devroots-Site/devroots
Catalog: public/docs/typescript/locales/*/LC_MESSAGES/index.po
Languages: de

source: Contents:
de: Inhalt:

source: TypeScript is a statically typed superset of JavaScript that compiles to plain JavaScript. It adds optional types, interfaces, and other features that help catch errors early and improve code quality and maintainability.
de: TypeScript ist eine statisch typisierte Obermenge von JavaScript, die sich zu einfachem JavaScript kompilieren lässt. Es fügt optionale Typen, Schnittstellen und andere Funktionen hinzu, die helfen, Fehler frühzeitig zu erkennen und die Codequalität und Wartbarkeit zu verbessern

source: Key Features:
de: Wesentliche Merkmale:

source: **Static Typing**: Add type annotations to variables, function parameters, and return values.
de: **Statische Typisierung**: Fügen Sie Variablen, Funktionsparametern und Rückgabewerten Typ-Annotationen hinzu.

source: **Interfaces & Type Aliases**: Define contracts for objects and structure for data.
de: **Schnittstellen und Typ-Aliase**: Definieren Sie Typen für Objekte und Strukturen für Daten.

source: **Classes & Inheritance**: Supports modern object-oriented programming.
de: **Klassen und Vererbung**: Unterstützt die moderne objektorientierte Programmierung.

source: **Modules**: Organize code into reusable units.
de: **Module**: Organisieren Sie Code in wiederverwendbare Einheiten.

source: **Type Inference**: Automatically deduces types when possible.
de: **Typeninferenz**: Automatische Ableitung von Typen, wenn möglich.

source: **Tooling Integration**: Works well with modern editors like VS Code for autocomplete and refactoring.
de: **Tooling-Integration**: Funktioniert gut mit modernen Editoren wie VS Code für Autovervollständigung und Refactoring.

source: **Strict Mode**: Enables a set of rules to catch more bugs early.
de: **Strenger Modus**: Aktiviert eine Reihe von Regeln, um mehr Fehler frühzeitig zu erkennen.

source: **Use Cases**:
de: **Verwendungszwecke**:

source: Large-scale applications where maintainability is key.
de: Groß angelegte Anwendungen, bei denen Wartungsfreundlichkeit eine wichtige Rolle spielt.

source: Projects where early bug detection is valuable.
de: Projekte, bei denen eine frühzeitige Fehlererkennung wichtig ist.

source: Teams looking to enforce coding standards and contracts.
de: Teams, die die Einhaltung von Kodierungsrichtlinien und Schnittstellen sicherstellen wollen.

source: Getting Started:
de: Erste Schritte:

source: Install via npm: `npm install -g typescript`
de: Installation über npm: „npm install -g typescript“.

source: Initialize: tsc --init
de: Initialisieren: tsc --init

source: Compile: tsc
de: Kompilieren: `tsc`

source: For more, see the full documentation at https://www.typescriptlang.org/docs/
de: Weitere Informationen finden Sie in der vollständigen Dokumentation unter https://www.typescriptlang.org/docs/.
